In [6]:
import pandas as pd
import numpy as np

import tabula
from tabula import read_pdf

In [25]:
df_sub1 = read_pdf("Annual-AP-Program-Participation-1956-2020_1.pdf", pages=1)
df_sub2 = read_pdf("Annual-AP-Program-Participation-1956-2020_1.pdf", pages=2)
df_sub1=df_sub1[0]
df_sub2=df_sub2[0]

df=pd.concat([df_sub1, df_sub2], axis=0)

In [29]:
df.head()

      Year Schools* Students no dat   Exams Colleges
0  1955-56      104           1,229   2,199      130
1  1956-57      212    2,068 no dat   3,772      201
2  1957-58      355    3,715 no dat   6,800      279
3  1958-59      560    5,862 no dat   8,265      391
4  1959-60      890   10,531 no dat  14,158      567

In [30]:
old_columns=['Schools*', 'Students no dat', 'Exams', 'Colleges']
new_columns=['num_schools', 'num_students', 'num_exams', 'num_colleges']             

for i in range(4):
    new=new_columns[i]
    old=old_columns[i]
    df[new]=df[old].str.rstrip("no dat")
    df[new]=df[new].str.replace(',','')
    df[new]=pd.to_numeric(df[new])

df=df.drop(columns=['Schools*', 'Students no dat', 'Exams', 'Colleges'])

In [33]:
df.to_csv("data/Ann_AP_Participation")

In [34]:
df

       Year  num_schools  num_students  num_exams  num_colleges
0   1955-56          104          1229       2199           130
1   1956-57          212          2068       3772           201
2   1957-58          355          3715       6800           279
3   1958-59          560          5862       8265           391
4   1959-60          890         10531      14158           567
..      ...          ...           ...        ...           ...
13  2015-16        21953       2611172    4704980          4199
14  2016-17        22169       2741426    4957931          4221
15  2017-18        22612       2808990    5090324          4287
16  2018-19        22678       2825710    5098815          4361
17  2019-20        22152       2642630    4751957          3160

[65 rows x 5 columns]